def transliterate(name):
    slovar = {'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ё': 'yo',
              'ж': 'zh', 'з': 'z', 'и': 'i', 'й': 'i', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n',
              'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ф': 'f', 'х': 'h',
              'ц': 'c', 'ч': 'ch', 'ш': 'sh', 'щ': 'sch', 'ъ': '', 'ы': 'y', 'ь': '', 'э': 'e',
              'ю': 'u', 'я': 'ya', 'А': 'A', 'Б': 'B', 'В': 'V', 'Г': 'G', 'Д': 'D', 'Е': 'E', 'Ё': 'Yo',
              'Ж': 'Zh', 'З': 'Z', 'И': 'I', 'Й': 'I', 'К': 'K', 'Л': 'L', 'М': 'M', 'Н': 'N',
              'О': 'O', 'П': 'P', 'Р': 'R', 'С': 'S', 'Т': 'T', 'У': 'U', 'Ф': 'F', 'Х': 'H',
              'Ц': 'C', 'Ч': 'Ch', 'Ш': 'Sh', 'Щ': 'Sch', 'Ъ': '', 'Ы': 'y', 'Ь': '', 'Э': 'E',
              'Ю': 'U', 'Я': 'Ya', ',': '', '?': '', ' ': ' ', '~': '', '!': '', '@': '', '#': '',
              '$': '', '%': '', '^': '', '&': '', '*': '', '(': '', ')': '', '-': '-', '=': '', '+': '',
              ':': '', ';': '', '<': '', '>': '', '\'': '', '"': '', '\\': '', '/': '', '№': '',
              '[': '', ']': '', '{': '', '}': '', 'ґ': '', 'ї': '', 'є': '', 'Ґ': 'g', 'Ї': 'i',
              'Є': 'e', '—': ''}

    for key in slovar:
        name = name.replace(key, slovar[key])
    return name


inputString = """Амур 	4416 	350 	1855 	Яблоневый хребет 	Татарский пролив 
Лена 	4400 	488 	2490 	Байкальский хребет 	Море Лаптевых 
Обь 	4070 	400 	2990 	Предгорья Алтая 	Карское море 
Иртыш 	4248 	323 	1643 	Китай 	Обь 
Енисей 	3487 	600 	2580 	Восточный Саян 	Карское море 
Волга 	3530 	255 	1360 	Валдайская возвышенность 	Каспийское море 
Колыма 	2129 	44 	643 	Хребет Черского 	Восточно — сибирское море 
Урал 	2428 	54 	231 	Южный Урал 	Каспийское море 
Дон 	2200 	45 	504 	Средне-русская возвышенность 	Азовское море 
Кама 	1805 	130 	507 	Верхне — Камская возвышенность 	Волга 
Печора 	1809 	130 	322 	Северный Урал 	Баренцево море 
Ангара 	1779 	62 	1039 	Байкал 	Енисей 
Селенга 	1024 	14 	447 	Монголия 	Байкал 
Кубань 	870 	11 	58 	Кавказ 	Азовское море 
Нева 	74 		281 	Ладожское озеро 	Балтийское море """


splitted = [i.split("\t") for i in inputString.split("\n")]
#print(splitted)


def formatData(data):
    data = data.strip()
    if data.isdigit():
        return int(data)
    else:
        return '\'' + transliterate(data) + '\''


for i in range(len(splitted)):
    lineArray = [formatData(j) for j in splitted[i]]
    print('river(', end='')
    for j in range(len(lineArray)):
        if j != 0:
            print(', ', end='')
        print(lineArray[j], end='')
    print(').')
